In [154]:
pwd

u'/Users/toddmoffett1/DSI/dsi_workspace/project-3/starter-code'

In [9]:
import pandas as pd
import numpy as np

In [141]:
data = {'name': ['Jason?,', 'Molly : ;', 'Tina', 'Jake', 'Amy'], 
        'town': ['LA', 'SF', 'NY', 'LA', 'SEA'],
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, columns = ['name', 'town','age', 'preTestScore', 'postTestScore'])
df

        name town  age  preTestScore  postTestScore
0    Jason?,   LA   42             4             25
1  Molly : ;   SF   52            24             94
2       Tina   NY   36            31             57
3       Jake   LA   24             2             62
4        Amy  SEA   73             3             70

In [142]:
df_town = pd.get_dummies(df["town"])

In [143]:
df_town

   LA  NY  SEA  SF
0   1   0    0   0
1   0   0    0   1
2   0   1    0   0
3   1   0    0   0
4   0   0    1   0

In [ ]:
def add_town_col(string):
    for t in town:
        if df['name'].str.contains(string).any():
        df[t] = np.where(df['town'].str.contains(string), 1, 0)

In [126]:
# Create function dummy columns for names
def add_col(string):
    if df['name'].str.contains(string).any():
        df[string] = np.where(df['name'].str.contains(string), 1, 0)

In [129]:
# activate dummy function
add_col('Molly')

In [131]:
df

        name  age  preTestScore  postTestScore  Molly
0    Jason?,   42             4             25      0
1  Molly : ;   52            24             94      1
2       Tina   36            31             57      0
3       Jake   24             2             62      0

In [92]:
df_names = pd.get_dummies(df['name'])

In [95]:
df.drop(4, axis=0, inplace=True)

In [97]:
df_merge = pd.merge(left=df, right=df_names, left_index=True, right_index=True, how='left' )

In [144]:
df_merge

,name,age,preTestScore,postTestScore,Amy,Jake,Jason,Molly,Tina
0,Jason,42,4,25,0,0,1,0,0
1,Molly,52,24,94,0,0,0,1,0
2,Tina,36,31,57,0,0,0,0,1
3,Jake,24,2,62,0,1,0,0,0

In [113]:
df_merge.columns

Index([u'name', u'age', u'preTestScore', u'postTestScore', u'Amy', u'Jake',
       u'Jason?,', u'Molly : ;', u'Tina'],
      dtype='object')

In [119]:
# function to clean titles of punctuation
def col_clean():
    df_merge.columns = df_merge.columns.str.replace('[^\w\s]',' ',)

col_clean()

In [135]:
# Remove all punctuation 
df_merge['name'] = df_merge['name'].str.replace('[^\w\s]','',)

In [132]:
df_merge

,name,age,preTestScore,postTestScore,Amy,Jake,Jason,Molly,Tina
0,Jason,42,4,25,0,0,1,0,0
1,Molly,52,24,94,0,0,0,1,0
2,Tina,36,31,57,0,0,0,0,1
3,Jake,24,2,62,0,1,0,0,0

In [137]:
df_merge[df_merge['postTestScore'] >= 60]

,name,age,preTestScore,postTestScore,Amy,Jake,Jason,Molly,Tina
1,Molly,52,24,94,0,0,0,1,0
3,Jake,24,2,62,0,1,0,0,0

In [152]:
df_total = pd.merge(left=df_merge, right=df_town, left_index=True, right_index=True, how='left', copy=False)

In [153]:
df_total

,name,age,preTestScore,postTestScore,Amy,Jake,Jason,Molly,Tina,LA,NY,SEA,SF
0,Jason,42,4,25,0,0,1,0,0,1,0,0,0
1,Molly,52,24,94,0,0,0,1,0,0,0,0,1
2,Tina,36,31,57,0,0,0,0,1,0,1,0,0
3,Jake,24,2,62,0,1,0,0,0,1,0,0,0